; domain
(define (domain driverlog)
  (:requirements :typing :fluents) 
  (:types           location locatable - object
		driver truck obj - locatable)

  (:predicates 
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - obj ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x ?y - location) (path ?x ?y - location)
		(empty ?v - truck)
)
  (:functions 	(time-to-walk ?l1 ?l2 - location)
		(time-to-drive ?l1 ?l2 - location)
		(fuel-used)
		(fuel-per-minute ?t - truck)
		(load ?t - truck)
  )


(:action LOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck) (increase (load ?truck) 1)
		(increase (fuel-per-minute ?truck) (+ (load ?truck) 1))))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc) (decrease (load ?truck) 1)
		(decrease (fuel-per-minute ?truck) (load ?truck))))


(:action BOARD-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action DISEMBARK-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - truck
    ?loc-from - location
    ?loc-to - location
    ?driver - driver)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
		(increase (fuel-used) (* (fuel-per-minute ?truck) (time-to-drive ?loc-from ?loc-to)))))

(:action WALK
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))

 
)

; problem
(define (problem DLOG-2-1-1-179)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	truck1 - truck
	package1 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	p1-3 - location
	p1-4 - location
	p6-1 - location
	p0-6 - location
	p5-0 - location
	p3-5 - location
	p4-0 - location
	p4-3 - location
	)
	(:init
	(at driver1 s2)
	(at driver2 s5)
	(at truck1 s1)
	(empty truck1)
	(= (load truck1) 0)
	(= (fuel-per-minute truck1) 10)
	(at package1 s0)
	(path s1 p1-3)
	(path p1-3 s1)
	(path s3 p1-3)
	(path p1-3 s3)
	(= (time-to-walk s1 p1-3) 6)
	(= (time-to-walk p1-3 s1) 6)
	(= (time-to-walk s3 p1-3) 5)
	(= (time-to-walk p1-3 s3) 5)
	(path s1 p1-4)
	(path p1-4 s1)
	(path s4 p1-4)
	(path p1-4 s4)
	(= (time-to-walk s1 p1-4) 3)
	(= (time-to-walk p1-4 s1) 3)
	(= (time-to-walk s4 p1-4) 6)
	(= (time-to-walk p1-4 s4) 6)
	(path s6 p6-1)
	(path p6-1 s6)
	(path s1 p6-1)
	(path p6-1 s1)
	(= (time-to-walk s6 p6-1) 5)
	(= (time-to-walk p6-1 s6) 5)
	(= (time-to-walk s1 p6-1) 2)
	(= (time-to-walk p6-1 s1) 2)
	(path s0 p0-6)
	(path p0-6 s0)
	(path s6 p0-6)
	(path p0-6 s6)
	(= (time-to-walk s0 p0-6) 6)
	(= (time-to-walk p0-6 s0) 6)
	(= (time-to-walk s6 p0-6) 2)
	(= (time-to-walk p0-6 s6) 2)
	(path s5 p5-0)
	(path p5-0 s5)
	(path s0 p5-0)
	(path p5-0 s0)
	(= (time-to-walk s5 p5-0) 5)
	(= (time-to-walk p5-0 s5) 5)
	(= (time-to-walk s0 p5-0) 3)
	(= (time-to-walk p5-0 s0) 3)
	(path s3 p3-5)
	(path p3-5 s3)
	(path s5 p3-5)
	(path p3-5 s5)
	(= (time-to-walk s3 p3-5) 5)
	(= (time-to-walk p3-5 s3) 5)
	(= (time-to-walk s5 p3-5) 3)
	(= (time-to-walk p3-5 s5) 3)
	(path s4 p4-0)
	(path p4-0 s4)
	(path s0 p4-0)
	(path p4-0 s0)
	(= (time-to-walk s4 p4-0) 3)
	(= (time-to-walk p4-0 s4) 3)
	(= (time-to-walk s0 p4-0) 4)
	(= (time-to-walk p4-0 s0) 4)
	(path s4 p4-3)
	(path p4-3 s4)
	(path s3 p4-3)
	(path p4-3 s3)
	(= (time-to-walk s4 p4-3) 5)
	(= (time-to-walk p4-3 s4) 5)
	(= (time-to-walk s3 p4-3) 2)
	(= (time-to-walk p4-3 s3) 2)
	(link s3 s2)
	(link s2 s3)
	(= (time-to-drive s3 s2) 5)
	(= (time-to-drive s2 s3) 5)
	(link s3 s4)
	(link s4 s3)
	(= (time-to-drive s3 s4) 4)
	(= (time-to-drive s4 s3) 4)
	(link s5 s6)
	(link s6 s5)
	(= (time-to-drive s5 s6) 5)
	(= (time-to-drive s6 s5) 5)
	(link s0 s3)
	(link s3 s0)
	(= (time-to-drive s0 s3) 5)
	(= (time-to-drive s3 s0) 5)
	(link s0 s5)
	(link s5 s0)
	(= (time-to-drive s0 s5) 7)
	(= (time-to-drive s5 s0) 7)
	(link s1 s4)
	(link s4 s1)
	(= (time-to-drive s1 s4) 5)
	(= (time-to-drive s4 s1) 5)
	(link s1 s5)
	(link s5 s1)
	(= (time-to-drive s1 s5) 4)
	(= (time-to-drive s5 s1) 4)
	(link s6 s1)
	(link s1 s6)
	(= (time-to-drive s6 s1) 7)
	(= (time-to-drive s1 s6) 7)
	(link s6 s3)
	(link s3 s6)
	(= (time-to-drive s6 s3) 2)
	(= (time-to-drive s3 s6) 2)
	(link s2 s1)
	(link s1 s2)
	(= (time-to-drive s2 s1) 6)
	(= (time-to-drive s1 s2) 6)
	(link s2 s5)
	(link s5 s2)
	(= (time-to-drive s2 s5) 2)
	(= (time-to-drive s5 s2) 2)
	(link s4 s2)
	(link s2 s4)
	(= (time-to-drive s4 s2) 4)
	(= (time-to-drive s2 s4) 4)
	(= (fuel-used) 0)
)
	(:goal (and
	(at driver2 s2)
	(at package1 s1)
	))

(:metric minimize (+ (* 3 (total-time)) (* 4 (fuel-used))))

)

; plan
1. (walk driver2 s5 p3-5)
   deleted: (at driver2 s5)
   added: (at driver2 p3-5)
   goals met: 0 of 2
2. (walk driver2 p3-5 s3)
   deleted: (at driver2 p3-5)
   added: (at driver2 s3)
   goals met: 0 of 2
3. (walk driver2 s3 p1-3)
   deleted: (at driver2 s3)
   added: (at driver2 p1-3)
   goals met: 0 of 2
4. (walk driver2 p1-3 s1)
   deleted: (at driver2 p1-3)
   added: (at driver2 s1)
   goals met: 0 of 2
5. (board-truck driver2 truck1 s1)
   deleted: (at driver2 s1) (empty truck1)
   added: (driving driver2 truck1)
   goals met: 0 of 2
6. (drive-truck truck1 s1 s5 driver2)
   deleted: (at truck1 s1)
   added: (at truck1 s5)
   changed: (fuel-used) from 0 to 40
   goals met: 0 of 2
7. (drive-truck truck1 s5 s0 driver2)
   deleted: (at truck1 s5)
   added: (at truck1 s0)
   changed: (fuel-used) from 40 to 110
   goals met: 0 of 2
8. (load-truck package1 truck1 s0)
   deleted: (at package1 s0)
   added: (in package1 truck1)
   changed: (load truck1) from 0 to 1, (fuel-per-minute truck1) from 10 to 11
   goals met: 0 of 2
9. (drive-truck truck1 s0 s5 driver2)
   deleted: (at truck1 s0)
   added: (at truck1 s5)
   changed: (fuel-used) from 110 to 187
   goals met: 0 of 2
10. (drive-truck truck1 s5 s1 driver2)
   deleted: (at truck1 s5)
   added: (at truck1 s1)
   changed: (fuel-used) from 187 to 231
   goals met: 0 of 2
11. (unload-truck package1 truck1 s1)
   deleted: (in package1 truck1)
   added: (at package1 s1)
   changed: (load truck1) from 1 to 0, (fuel-per-minute truck1) from 11 to 10
   goals met: 1 of 2
12. (drive-truck truck1 s1 s2 driver2)
   deleted: (at truck1 s1)
   added: (at truck1 s2)
   changed: (fuel-used) from 231 to 291
   goals met: 1 of 2
13. (disembark-truck driver2 truck1 s2)
   deleted: (driving driver2 truck1)
   added: (at driver2 s2) (empty truck1)
   goals met: 2 of 2
